In [1]:
import pandas as pd

In [4]:
def load_csv(file_path):
    return pd.read_csv(file_path)

food = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_foods.csv"
rw1s = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_week_1_sales.csv"
rw2s = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_week_2_sales.csv"
rw1t = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_week_1_times.csv"
rcust = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_customers.csv"

food_data = load_csv(food)
print('FOOD')
display(food_data.head(5))

res_w1_sales = load_csv(rw1s)
print('WEEK 1 SALES')
display(res_w1_sales.head(5))

res_w2_sales = load_csv(rw2s)
print('WEEK 2 SALES')
display(res_w2_sales.head(5))

customer_data = load_csv(rcust)
print('CUSTOMERS')
display(customer_data.head(5))

res_w1_time = load_csv(rw1t)
print('WEEK 1 TIME')
display(res_w1_time.head(5))

FOOD

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

WEEK 1 SALES

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

WEEK 2 SALES

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

CUSTOMERS

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

WEEK 1 TIME

  Time of Day
0    14:54:59
1    20:55:17
2    01:16:22
3    16:17:26
4    19:26:11

In [6]:
print('Length of Week 1:', len(res_w1_sales))
print('Length of Week 2:', len(res_w2_sales))

Length of Week 1: 250
Length of Week 2: 250

### Concat function

The `pd.concat()` function in the pandas library is used to concatenate or combine multiple Series or DataFrame objects along a specific axis (either rows or columns). 

This is particularly useful for stacking datasets on top of each other or stitching them side-by-side to create a unified dataset for analysis.  

`pd.concat([df1, df2])`

`pd.concat([df1, df2], ignore_index = False)`

`pd.concat([df1, df2], ignore_index = True)`

`pd.concat([df1, df2], keys = ["df1", "df2"]).sort_index()`

In [7]:
pd.concat([res_w1_sales, res_w2_sales])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [15]:
print('Concat with ignore_index = False')
display(pd.concat([res_w1_sales, res_w2_sales], ignore_index = False))

print('Concat with ignore_index = True')
display(pd.concat([res_w1_sales, res_w2_sales], ignore_index = True))

Concat with ignore_index = False

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

Concat with ignore_index = True

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [16]:
print('Concat with sort_index()')
display(pd.concat([res_w1_sales, res_w2_sales], keys = ["res_w1_sales", "res_w2_sales"]).sort_index())

Concat with sort_index()

                  Customer ID  Food ID
res_w1_sales 0            537        9
             1             97        4
             2            658        1
             3            202        2
             4            155        9
...                       ...      ...
res_w2_sales 245          783       10
             246          556       10
             247          547        9
             248          252        9
             249          249        6

[500 rows x 2 columns]

In [17]:
df1 = pd.DataFrame([1,2,3], columns=['A'])
df2 = pd.DataFrame([4,5,6], columns=['B'])

In [20]:
print('Merging the columns by stacking the dataframes')
display(pd.concat([df1, df2]))

Merging the columns by stacking the dataframes

     A    B
0  1.0  NaN
1  2.0  NaN
2  3.0  NaN
0  NaN  4.0
1  NaN  5.0
2  NaN  6.0

In [22]:
print('Merging the columns side by side')
display(pd.concat([df1, df2], axis='columns'))

Merging the columns side by side

   A  B
0  1  4
1  2  5
2  3  6

### Merge function - Left Join 

`df1.merge(df2, how='left', on='common attribute')`

In [28]:
print('Merging FOOD Data to WEEK 1 SALES Data')
display(res_w1_sales.merge(food_data, how='left', on="Food ID"))

Merging FOOD Data to WEEK 1 SALES Data

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

### Merge function - Right Join

`df1.merge(df2, how='right', on='common attribute')`

In [30]:
res_w2_sales.merge(food_data, how='right', on='Food ID')

     Customer ID  Food ID Food Item  Price
0            713        1     Sushi   3.99
1            473        1     Sushi   3.99
2            922        1     Sushi   3.99
3            647        1     Sushi   3.99
4            397        1     Sushi   3.99
..           ...      ...       ...    ...
245          463       10     Drink   1.75
246          734       10     Drink   1.75
247          559       10     Drink   1.75
248          783       10     Drink   1.75
249          556       10     Drink   1.75

[250 rows x 4 columns]

### More on left join

`df1.merge(df2, how='left', left_on='common attribute', right_on='other common attribute')`

`df1.merge(df2, how='left', left_on='common attribute', right_on='other common attribute').drop("other common attribute", axis='')`

In [32]:
res_w2_sales.merge(customer_data, how='left', left_on='Customer ID', right_on='ID')

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [33]:
res_w2_sales.merge(customer_data, how='left', left_on='Customer ID', right_on='ID').drop('ID', axis='columns')

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I